# GetSegPt2

## Description
Procedure GetSegPt2 returns the end point of the of the referenced line, wall, or linear dimension object.

```pascal
PROCEDURE GetSegPt2(
				h         : HANDLE;
				VAR pX,pY : REAL);
```

```python
def vs.GetSegPt2(h):
    return p
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to line.|
|p|REAL|Coordinates of end point.|

## Examples
```pascal
BEGIN
	GetSegPt1(itemHandle, v1[1], v1[2]);
	GetSegPt2(itemHandle, v2[1], v2[2]);
	DrawLineLabel(v2 - v1, v1[1], v1[2]);
END;

if (wallH <> nil) & pSize_to_Wall_Length then BEGIN
	GetSegPt1(wallH, beg_pt.x, beg_pt.y);
	GetSegPt2(wallH, END_pt.x, END_pt.y);
	lngth := Distance(beg_pt.x, beg_pt.y, END_pt.x, END_pt.y);
	lngth := lngth + pAdd_to_Start + pAdd_to_END;
	beg_pt := WorldToObjectCoords(pluginH, beg_pt);
	originX := beg_pt.x - pAdd_TO_Start;

BEGIN
	GetSegPt1(gWallHand, begwall_pt.x, begwall_pt.y);
	GetSegPt2(gWallHand, endwall_pt.x, endwall_pt.y);
```
```python
import vs

# Procedure GetSegPt2 returns the end point of the of the referenced line,
# wall, or linear dimension object.
h = vs.FSActLayer()  # handle to the first selected object on the active layer

result = vs.GetSegPt2(h)
```
See also in tutorials: 27. Formatted Wall Schedule, 29. Cross-Layer Summary

## Version
Availability: from All Versions

## Category
* Objects - 2D